Yes, the output of `terraform show` is now "This plan does nothing.", as expected.

Full session (with #21911 build):

<pre>
<details>
$ ~/go/src/github.com/hashicorp/terraform/pkg/darwin_amd64/terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.my-awesome-bucket-123456 will be created
  + resource "aws_s3_bucket" "my-awesome-bucket-123456" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "my-awesome-bucket-123456"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

$ ~/go/src/github.com/hashicorp/terraform/pkg/darwin_amd64/terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.my-awesome-bucket-123456 will be created
  + resource "aws_s3_bucket" "my-awesome-bucket-123456" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "my-awesome-bucket-123456"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_s3_bucket.my-awesome-bucket-123456: Creating...
aws_s3_bucket.my-awesome-bucket-123456: Still creating... [10s elapsed]
aws_s3_bucket.my-awesome-bucket-123456: Creation complete after 16s [id=my-awesome-bucket-123456]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

$ ~/go/src/github.com/hashicorp/terraform/pkg/darwin_amd64/terraform plan -out plan_file
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

aws_s3_bucket.my-awesome-bucket-123456: Refreshing state... [id=my-awesome-bucket-123456]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

$ ~/go/src/github.com/hashicorp/terraform/pkg/darwin_amd64/terraform show plan_file
This plan does nothing.
</details>
</pre>